from Source.Core.YtDlp import YtDlp

class BaseProcessor:
	"""Базовый обработчик источника видео."""

	#==========================================================================================#
	# >>>>> ПЕРЕОПРЕДЕЛЯЕМЫЕ МЕТОДЫ <<<<< #
	#==========================================================================================#

	def _DownloadVideo(self, url: str):
		"""
		Скачивает видео.

		:param url: Ссылка на видео.
		:type url: str
		"""

		self._YtDlp.download_video(url)

	def _PostInitMethod(self):
		"""Метод, вызывающийся после инициализации объекта."""

		pass

	#==========================================================================================#
	# >>>>> ПУБЛИЧНЫЕ МЕТОДЫ <<<<< #
	#==========================================================================================#

	def __init__(self):
		"""Базовый обработчик источника видео."""

		self._YtDlp = YtDlp()

		self._PostInitMethod()

	def download_video(self, url: str):
		"""
		Скачивает видео.

		:param url: Ссылка на видео.
		:type url: str
		"""

		self._DownloadVideo(url)